<a href="https://colab.research.google.com/github/ranjiGT/MachineLearning/blob/master/Pandas_edited(16_08).ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

[Basic Data Exploration](#basic-explor)

[Bivariate analysis](#bivar)

## Course Structure

1. Module 0 - Native Data Types in Python
2. Module 1 - Intro to Pandas library & Basis Dataframe attributes
3. Module 2 - Common Data manipulation tasks using Pandas
4. Module 3 - Loops and Functions 
5. Module 4 - Visualization
6. Module 5 - Other miscellaneous topics

# Basic data types

In [ ]:
from IPython.core.interactiveshell import InteractiveShell
InteractiveShell.ast_node_interactivity = "all"

In [ ]:
x = [1,"b",3]

In [ ]:
x[1]

In [ ]:
student_dict = {"s_1":["IBM","TCS"],"s_2" :["HP"], "s_3":["INFOSYS","WIPRO"]}

In [ ]:
[val for k,val in student_dict.items()]

In [ ]:
student_dict.keys()

In [ ]:
x = ["abe",1,"c"]

In [ ]:
dist_ex = {"S1":["HCL","TCS"],"S2":["Benz"]}

In [ ]:
for k,v in dist_ex.items():
    if k == "S1":
        print(k)

In [ ]:
x.append("h")

In [ ]:
x

In [ ]:
tup_ex = (1,2,3,1)

In [ ]:
!pip install pandas

In [ ]:
list_ex = [1,2,3]
dist_ex = {"Age":25,"Weight":70}

tup_ex = (1,2,3,1)

In [ ]:
from pandas import read_csv

In [3]:
# read the data
import pandas as pd
import numpy as np
df = pd.read_csv("Uber Drives 2016.csv")

In [4]:
df = pd.read_csv("Uber Drives 2016.csv")
df

#dfO = pd.read_csv("Ola_Rides_2018.csv")
#dfO

           START_DATE*         END_DATE*  ...   MILES*         PURPOSE*
0     01-01-2016 21:11  01-01-2016 21:17  ...      5.1   Meal-Entertain
1     01-02-2016 01:25  01-02-2016 01:37  ...      5.0              NaN
2     01-02-2016 20:25  01-02-2016 20:38  ...      4.8  Errand-Supplies
3     01-05-2016 17:31  01-05-2016 17:45  ...      4.7          Meeting
4     01-06-2016 14:42  01-06-2016 15:49  ...     63.7   Customer Visit
...                ...               ...  ...      ...              ...
1151  12-31-2016 13:24  12-31-2016 13:42  ...      3.9   Temporary Site
1152  12-31-2016 15:03  12-31-2016 15:38  ...     16.2          Meeting
1153  12-31-2016 21:32  12-31-2016 21:50  ...      6.4   Temporary Site
1154  12-31-2016 22:08  12-31-2016 23:51  ...     48.2   Temporary Site
1155               NaN               NaN  ...  12204.7              NaN

[1156 rows x 7 columns]

In [ ]:
df9 = pd.read_csv("winequality-red.csv")
df9
#df9.dtypes

In [ ]:
df.dtypes

# Key Modules

1. Basic Dataframe operations
2. Common data manipulation tasks
3. Loops and Functions

## Basic dataframe operations

In [ ]:
df.head()

In [ ]:
df.shape

In [ ]:
hasattr(df,"head")
callable(getattr(df,"head"))

In [ ]:
df.tail()

In [ ]:
df.dtypes

### Changing data types

In [ ]:
temp = pd.DataFrame({"A":["1","2","3"],"B":[11,12,13],"C": ["12-06-2012","13-06-2015","15-06-2017"]})

In [ ]:
temp.dtypes

In [ ]:
temp["C"] = pd.to_datetime(temp["C"])
temp["C"]

In [ ]:
temp["A"] = pd.to_numeric(temp["A"])

In [ ]:
temp.dtypes

In [ ]:

temp["A"] = temp["A"].astype(str)

In [ ]:
temp.dtypes

In [ ]:
# convert data to datetime format
pd.to_datetime(df["START_DATE*"])
df.dtypes
# Available time formats: https://docs.python.org/3/library/datetime.html#strftime-and-strptime-behavior

START_DATE*    datetime64[ns]
END_DATE*              object
CATEGORY*              object
START*                 object
STOP*                  object
MILES*                float64
PURPOSE*               object
miles_cat              object
LMS                    object
dtype: object

### Dataset summarization methods

In [ ]:
df.describe(include="all")

In [ ]:
df.info()

In [ ]:
# count of unique start locations
df["START*"].value_counts().head()

Cary                201
Unknown Location    148
Morrisville          85
Whitebridge          68
Islamabad            57
Name: START*, dtype: int64

## Common data manipulation tasks

5 verbs of data manipulation

1. Selecting/Indexing
2. Filtering
3. Sorting
4. Mutating/ Conditionally adding columns
5. Groupby/Summarize

### Select/Indexing

In [ ]:
df.iloc[0:4,0:]

In [ ]:
df.iloc[0:5,[0,3]]

In [ ]:
## Positional Indexing
df.iloc[0:4,[1,6]]

In [ ]:
df.iloc[0:4,0:3]

In [ ]:
# label based indexing
df.loc[:,["START_DATE*","CATEGORY*"]].head()

In [ ]:
df[["START_DATE*","CATEGORY*"]].tail()

In [ ]:
x = df[["START*"]]
x

In [ ]:
s1 = df.loc[:,"START*"]
s1

### In Class assignment

Extract first 5 rows and columns START_DATE* and MILES*

In [9]:
#df.loc[0:4,["START_DATE*","MILES*"]] #Way 1

df[["START_DATE*","MILES*"]].head(5) #Way 2

        START_DATE*  MILES*
0  01-01-2016 21:11     5.1
1  01-02-2016 01:25     5.0
2  01-02-2016 20:25     4.8
3  01-05-2016 17:31     4.7
4  01-06-2016 14:42    63.7

### Filtering

In [ ]:
df2 = df.loc[df["MILES*"] > 10,["MILES*"]]
print(df2)

In [ ]:
df3 = df2.loc[0:5]
df3

In [25]:
# find out all rides greater than 10 miles
df.loc[df["MILES*"] > 10].head()

         START_DATE*         END_DATE*  ... MILES*        PURPOSE*
4   01-06-2016 14:42  01-06-2016 15:49  ...   63.7  Customer Visit
9   01-10-2016 12:17  01-10-2016 12:44  ...   16.5  Customer Visit
10  01-10-2016 15:08  01-10-2016 15:51  ...   10.8         Meeting
22  01-12-2016 16:02  01-12-2016 17:00  ...   15.1         Meeting
23   1-13-2016 13:54   1-13-2016 14:07  ...   11.2         Meeting

[5 rows x 7 columns]

In [29]:
# Find out all rides to Cary
df.loc[df["START*"]=="Cary",["MILES*"]].head()

    MILES*
7      0.8
8      8.3
28    10.4
30     4.8
34    17.1

In [32]:
# Find out all rides to Cary & Morrisville          
my_rides = df[df["START*"].isin(["Cary","Morrisville"])]
my_rides.iloc[:,[0,5]]

           START_DATE*  MILES*
7     01-07-2016 13:27     0.8
8     01-10-2016 08:05     8.3
27      1-15-2016 0:41     8.0
28     1-15-2016 11:43    10.4
30     1-18-2016 14:55     4.8
...                ...     ...
1050  12-14-2016 16:52     3.4
1051  12-14-2016 17:22     3.3
1052  12-14-2016 17:50     3.0
1053  12-14-2016 20:24     3.1
1054  12-15-2016 14:20    10.6

[286 rows x 2 columns]

In [33]:
# Find out all rides to Cary & Morrisville          
df.loc[df["START*"].isin(["Cary","Morrisville"])]

           START_DATE*         END_DATE*  ... MILES*         PURPOSE*
7     01-07-2016 13:27  01-07-2016 13:33  ...    0.8          Meeting
8     01-10-2016 08:05  01-10-2016 08:25  ...    8.3          Meeting
27      1-15-2016 0:41    1-15-2016 1:01  ...    8.0  Errand-Supplies
28     1-15-2016 11:43   1-15-2016 12:03  ...   10.4   Meal-Entertain
30     1-18-2016 14:55   1-18-2016 15:06  ...    4.8   Meal-Entertain
...                ...               ...  ...    ...              ...
1050  12-14-2016 16:52  12-14-2016 17:10  ...    3.4              NaN
1051  12-14-2016 17:22  12-14-2016 17:34  ...    3.3              NaN
1052  12-14-2016 17:50  12-14-2016 18:00  ...    3.0   Meal-Entertain
1053  12-14-2016 20:24  12-14-2016 20:40  ...    3.1   Customer Visit
1054  12-15-2016 14:20  12-15-2016 14:54  ...   10.6          Meeting

[286 rows x 7 columns]

In [ ]:
df.loc[~df["START*"].isin(["Cary","Morrisville"])].shape

#### In class assignment

1. Find all trips with distance > 10 miles and originating from Cary and Morris.

2. Extract top 3 rows from the filtered dataset

In [53]:
x = df.loc[(df["MILES*"] > 10)&df["START*"].isin(["Cary","Morrisville","Fort Pierce"])]
x.reset_index(inplace=True, drop=True)
x.head(30)

         START_DATE*         END_DATE*  ... MILES*         PURPOSE*
0   01-06-2016 14:42  01-06-2016 15:49  ...   63.7   Customer Visit
1    1-15-2016 11:43   1-15-2016 12:03  ...   10.4   Meal-Entertain
2    1-20-2016 10:36   1-20-2016 11:11  ...   17.1          Meeting
3    1-27-2016 10:19   1-27-2016 10:48  ...   18.7   Customer Visit
4    1-28-2016 12:28   1-28-2016 13:00  ...   19.0   Temporary Site
5    1-29-2016 11:43   1-29-2016 12:03  ...   10.4          Meeting
6   02-01-2016 10:35  02-01-2016 11:15  ...   19.4   Customer Visit
7   02-05-2016 11:47  02-05-2016 12:07  ...   10.4          Meeting
8   02-06-2016 16:20  02-06-2016 16:53  ...   11.4  Between Offices
9   02-11-2016 16:28  02-11-2016 17:10  ...   17.3   Meal-Entertain
10  02-12-2016 11:14  02-12-2016 11:35  ...   17.0   Customer Visit
11  02-12-2016 15:33  02-12-2016 16:06  ...   11.5   Customer Visit
12   2-26-2016 11:35   2-26-2016 11:59  ...   10.6          Meeting
13  03-04-2016 11:46  03-04-2016 12:06  ...   10.4          Meeting
14  03-04-2016 13:40  03-04-2016 14:09  ...   15.7   Customer Visit
15  03-07-2016 09:23  03-07-2016 09:47  ...   12.4   Customer Visit
16   3-25-2016 13:24   3-25-2016 16:22  ...  144.0   Customer Visit
17  04-08-2016 12:30  04-08-2016 12:48  ...   10.5          Meeting
18  04-08-2016 14:43  04-08-2016 15:20  ...   19.1          Meeting
19    4-14-2016 7:29    4-14-2016 8:09  ...   15.3   Temporary Site
20   4-15-2016 11:36   4-15-2016 12:07  ...   11.9   Temporary Site
21    4-22-2016 8:25    4-22-2016 9:04  ...   13.6          Meeting
22   4-22-2016 12:08   4-22-2016 12:28  ...   10.4          Meeting
23   4-28-2016 12:09   4-28-2016 12:34  ...   12.4   Customer Visit
24   4-29-2016 18:46   4-29-2016 19:18  ...   14.2   Customer Visit
25   5-28-2016 14:35   5-28-2016 15:04  ...   11.3   Customer Visit
26   5-31-2016 13:54   5-31-2016 14:41  ...   14.9          Meeting
27  06-03-2016 11:29  06-03-2016 11:49  ...   10.4          Meeting
28  06-06-2016 21:41  06-06-2016 22:00  ...   10.4          Meeting
29  06-07-2016 21:42  06-07-2016 22:00  ...   10.4          Meeting

[30 rows x 7 columns]

### Sorting

In [ ]:
df.sort_values(by=["MILES*"],ascending=False).head(5)

In [ ]:
df.sort_values(by=["START*", "MILES*"],ascending=[True,False]).head(5)

### Conditionally adding columns

In [ ]:
import numpy as np
df["miles_cat"] = np.where(df["MILES*"] > 5,"Long Trip","Short Trip")

In [ ]:
df.head()

        START_DATE*         END_DATE*  ...         PURPOSE*   miles_cat
0  01-01-2016 21:11  01-01-2016 21:17  ...   Meal-Entertain   Long Trip
1  01-02-2016 01:25  01-02-2016 01:37  ...              NaN  Short Trip
2  01-02-2016 20:25  01-02-2016 20:38  ...  Errand-Supplies  Short Trip
3  01-05-2016 17:31  01-05-2016 17:45  ...          Meeting  Short Trip
4  01-06-2016 14:42  01-06-2016 15:49  ...   Customer Visit   Long Trip

[5 rows x 8 columns]

In [ ]:
df["miles_cat"].value_counts()

Long Trip     654
Short Trip    502
Name: miles_cat, dtype: int64

In [ ]:
df.loc[df["MILES*"] > 5].shape

(654, 8)

## In class Assignment

Create a new column with the following condition:

a) > 10 - Long Trip

b) 5 - 10  - Medium

c) < 5 - Short Trip

In [ ]:
#Technique 1
df["LMS"] = np.where(df["MILES*"] > 10,"Long Trip",np.where(df["MILES*"]<5,"Short Trip","Medium trip")) 


#Technique 2
#df.head(n=100)
#rules = [(df["MILES*"]>10), ((df["MILES*"]>=5)&(df["MILES*"]<10)), (df["MILES*"]<5)]

#choice = ["Long","Medium","Short"]

#df["LMS"] = np.select(rules,choice)


df.head(n=100)

         START_DATE*         END_DATE*  ...   miles_cat          LMS
0   01-01-2016 21:11  01-01-2016 21:17  ...   Long Trip  Medium trip
1   01-02-2016 01:25  01-02-2016 01:37  ...  Short Trip  Medium trip
2   01-02-2016 20:25  01-02-2016 20:38  ...  Short Trip   Short Trip
3   01-05-2016 17:31  01-05-2016 17:45  ...  Short Trip   Short Trip
4   01-06-2016 14:42  01-06-2016 15:49  ...   Long Trip    Long Trip
..               ...               ...  ...         ...          ...
95  02-12-2016 08:21  02-12-2016 08:42  ...   Long Trip  Medium trip
96  02-12-2016 10:45  02-12-2016 10:52  ...  Short Trip   Short Trip
97  02-12-2016 11:14  02-12-2016 11:35  ...   Long Trip    Long Trip
98  02-12-2016 13:02  02-12-2016 13:36  ...   Long Trip    Long Trip
99  02-12-2016 14:49  02-12-2016 15:06  ...   Long Trip  Medium trip

[100 rows x 9 columns]

### Groupby Summarize

In [ ]:
# for each start loc find the mean distance travelled
#df.groupby("START*")["MILES*"].agg("mean")
df.groupby("STOP*").mean()

                        MILES*
STOP*
Agnew                 2.925000
Alief                15.500000
Almond                6.600000
Apex                  6.011765
Arabi                 1.100000
...                        ...
Weston                2.900000
Westpark Place        2.250000
Whitebridge           3.773846
Williamsburg Manor    8.300000
Winston Salem       107.000000

[188 rows x 1 columns]

In [ ]:
# for each start loc find the mean & the total dist travelled
df.groupby("START*").agg(["mean","sum"]).head()

              MILES*
                mean   sum
START*
Agnew       2.775000  11.1
Almond     15.200000  15.2
Apex        5.341176  90.8
Arabi      17.000000  17.0
Arlington   4.900000   4.9

In [ ]:
df.mean

In [ ]:
df.groupby(["START*","STOP*"]).agg(["mean","sum"]).head(20)

### In class assignment

Find most recent & the earliest travelled date and mean distance traveled for each start city

In [ ]:
df = df.iloc[:-1,:] # to remove the last record or tuple from the dataframe
#df.tail()
df["START_DATE*"] = pd.to_datetime(df["START_DATE*"])
#df.dtypes
res = df.groupby("START*").agg({"MILES*":["mean"], "START_DATE*":["min","max"]}).head(20)
res.reset_index(inplace=True,) #inplace = for index start from 0...n; drop = replace the group by clause

#res
res.columns = ["START_CITY*","AVG_DIST*","EARLIEST TRIP*","RECENT TRIP*"] #to update the columns
res
res.to_csv("res1.csv",index=False) # to unconsider index

## Loops and Function

In [ ]:
# Basic for loop
res = []
temp = [1,2,3,4]
for i in temp:
    res.append(i*i)
res

In [ ]:
# List comprehension way

[x*x for x in temp]

## ***Advanced operations on numerical columns***

In [ ]:
store_sales = pd.read_csv("store_sales.csv")

In [ ]:
store_sales.head(20)

   store_id        city  Jan  Feb  Mar  Apr  ...  July  Aug  Sep  Oct  Nov  Dec
0       S_1       Texas    8   20   13   21  ...    24   17   16    9    7    6
1       S_2  California   12   19   15   15  ...     7   15   10   11   21   19
2       S_3  California   16   16   14   19  ...    13   13   15   14   24    8
3       S_4       Texas    8   18   13   10  ...     6    8    8   18    7   11
4       S_5       Texas   19    5   24    9  ...    10    5   24   15    6   13
5       S_6  California   14   21   18   20  ...    18   24    7   12   11    5
6       S_7     Arizona   11   22    5   14  ...     8   15   18   14   17   20
7       S_8  California   15    8    5   15  ...    17   19   13    6   24   15
8       S_9       Texas   15    7    6   20  ...    19   15   19   17   22    5
9      S_10  California   14   23   20   11  ...    19    6    5   22   17   16
10     S_11     Arizona   15   24    8   15  ...     6   21   20   13   14   15
11     S_12  California    6   18   21    8  ...    11    9   21   17   18   22
12     S_13     Arizona    7   12   18   15  ...    17   24   23   23   14    7
13     S_14       Texas   21    7   22   11  ...     7   23   15    7    9   12
14     S_15     Arizona   12    6   14   21  ...    23   17   13   21    9   18
15     S_16  California   18    9    8    9  ...    19   18   21    7    7   23
16     S_17  California   13    8    7   22  ...    18    5   24   18   12   17
17     S_18     Arizona   19   21   22   12  ...     8   17   15   10   24   10
18     S_19  California    7    6   17    8  ...    20    9   11   22   21    8
19     S_20  California   11   21   20    6  ...    14   23   19   10   21   22

[20 rows x 14 columns]

In [ ]:
# find out avg sales for each month
#store_sales["Jan"].mean() #For one month
#store_sales.apply("mean") #across month one-liner

# axis = 0 for columns, axis = 1 for rows
store_sales.apply("mean", axis=0) # axis=0 (default) identifies the real-valued columns 0

Jan     14.46
Feb     15.09
Mar     14.56
Apr     14.57
May     13.56
Jun     13.80
July    14.38
Aug     15.81
Sep     14.91
Oct     14.10
Nov     15.31
Dec     13.57
dtype: float64

In [ ]:
# find out avg sales for each store
store_sales.apply("mean", axis=1) #Cannot perform the renaming of columns over the Series
#Above result is a Series 


#apply() works row-wise and col-wise (as whole)
#agg() works in grouping over which apply() is operated

store_sales.select_dtypes(include=["int64","float64"]).apply("mean") # To forecully omit the string columns while processing

Jan     14.46
Feb     15.09
Mar     14.56
Apr     14.57
May     13.56
Jun     13.80
July    14.38
Aug     15.81
Sep     14.91
Oct     14.10
Nov     15.31
Dec     13.57
dtype: float64

In [ ]:
#store_sales.groupby("city").apply("mean") #ERROR!

#REQ: Group by cities and then find the average of the sales
store_sales.groupby("city").agg("mean")

                  Jan        Feb        Mar  ...        Oct        Nov        Dec
city                                         ...
Arizona     15.500000  15.272727  14.545455  ...  14.954545  16.409091  13.318182
California  14.744186  15.534884  14.627907  ...  14.279070  15.279070  13.604651
Texas       13.457143  14.428571  14.485714  ...  13.342857  14.657143  13.685714

[3 rows x 12 columns]

In [ ]:
def bonus_func(sales_col):
  eli_val = np.where(sales_col >10, "Eligible","Not Eligible")
  return eli_val
#store_sales["Jan_Bonus"] = bonus_func(store_sales["Jan"]) # add a new column based on condition
#store_sales["Mar_Bonus"] = bonus_func(store_sales["Mar"])
#newdf = store_sales.apply(bonus_func) #ERROR ! 
newdf = store_sales.select_dtypes(include=['int64','float64']).apply(bonus_func) #labeling entire frame by applying condition 
newdf
res = pd.concat([newdf,store_sales], axis=1)
res.shape
res.tail(100)

             Jan           Feb           Mar  ... Dec     Jan_Bonus     Mar_Bonus
0   Not Eligible      Eligible      Eligible  ...   6  Not Eligible      Eligible
1       Eligible      Eligible      Eligible  ...  19      Eligible      Eligible
2       Eligible      Eligible      Eligible  ...   8      Eligible      Eligible
3   Not Eligible      Eligible      Eligible  ...  11  Not Eligible      Eligible
4       Eligible  Not Eligible      Eligible  ...  13      Eligible      Eligible
..           ...           ...           ...  ...  ..           ...           ...
95  Not Eligible  Not Eligible      Eligible  ...  22  Not Eligible      Eligible
96      Eligible  Not Eligible  Not Eligible  ...   9      Eligible  Not Eligible
97      Eligible  Not Eligible  Not Eligible  ...  22      Eligible  Not Eligible
98      Eligible      Eligible  Not Eligible  ...  10      Eligible  Not Eligible
99  Not Eligible      Eligible      Eligible  ...   9  Not Eligible      Eligible

[100 rows x 28 columns]

In [ ]:
def bonus_func(sales_col):
    return ["Eligible" if x > 15 else "Not Eligible" for x in sales_col]
bonus_func([12,23,56])

['Not Eligible', 'Eligible', 'Eligible']

In [ ]:
store_sales.iloc[:,2:].select_dtypes(include=['int64','float64']).apply(bonus_func).head() #POS-based

            Jan           Feb  ...           Nov           Dec
0  Not Eligible      Eligible  ...  Not Eligible  Not Eligible
1      Eligible      Eligible  ...      Eligible      Eligible
2      Eligible      Eligible  ...      Eligible  Not Eligible
3  Not Eligible      Eligible  ...  Not Eligible      Eligible
4      Eligible  Not Eligible  ...  Not Eligible      Eligible

[5 rows x 12 columns]

In [ ]:
store_sales.loc[:,"Jan":].select_dtypes(include=['int64','float64']).apply(bonus_func).head() #label-based

            Jan           Feb  ...           Nov           Dec
0  Not Eligible      Eligible  ...  Not Eligible  Not Eligible
1      Eligible      Eligible  ...      Eligible      Eligible
2      Eligible      Eligible  ...      Eligible  Not Eligible
3  Not Eligible      Eligible  ...  Not Eligible      Eligible
4      Eligible  Not Eligible  ...  Not Eligible      Eligible

[5 rows x 12 columns]

In [ ]:
store_sales.iloc[:,2:].select_dtypes(include=['int64','float64']).apply(lambda sales_numbers: ["Eligible" if x > 15 else "Not Eligible" for x in sales_numbers]).head() #without func call

            Jan           Feb  ...           Nov           Dec
0  Not Eligible      Eligible  ...  Not Eligible  Not Eligible
1  Not Eligible      Eligible  ...      Eligible      Eligible
2      Eligible      Eligible  ...      Eligible  Not Eligible
3  Not Eligible      Eligible  ...  Not Eligible  Not Eligible
4      Eligible  Not Eligible  ...  Not Eligible  Not Eligible

[5 rows x 12 columns]

In [ ]:
store_sales.columns

Index(['store_id', 'city', 'Jan', 'Feb', 'Mar', 'Apr', 'May', 'Jun', 'July',
       'Aug', 'Sep', 'Oct', 'Nov', 'Dec', 'Jan_Bonus', 'Mar_Bonus'],
      dtype='object')

In [ ]:
store_sales.groupby("city").agg("mean")

### Assignments

1) Find mean quarterly sales by store

2) Find the month with highest sales for each store

## Other/Miscellaneous topics

### Missing value treatment

In [ ]:
df.isnull().sum()

START_DATE*      1
END_DATE*        1
CATEGORY*        1
START*           1
STOP*            1
MILES*           0
PURPOSE*       503
miles_cat        0
dtype: int64

In [ ]:
## Count missing values
df.isnull().sum()

START_DATE*    0
END_DATE*      0
CATEGORY*      0
START*         0
STOP*          0
MILES*         0
PURPOSE*       0
dtype: int64

In [ ]:
# Fill NA with most common values
df["PURPOSE*"].value_counts()

Not Mentioned      488
Meeting            157
Meal-Entertain     130
Errand-Supplies     86
Customer Visit      76
Temporary Site      40
Between Offices     16
Moving               4
Commute              1
Charity ($)          1
Airport-Travel       1
Name: PURPOSE*, dtype: int64

In [ ]:
df = df.fillna({"PURPOSE*":"Not Mentioned"}).head(1000) #one time operation
df

          START_DATE*         END_DATE*  ... MILES*         PURPOSE*
0    01-01-2016 21:11  01-01-2016 21:17  ...    5.1   Meal-Entertain
1    01-02-2016 01:25  01-02-2016 01:37  ...    5.0    Not Mentioned
2    01-02-2016 20:25  01-02-2016 20:38  ...    4.8  Errand-Supplies
3    01-05-2016 17:31  01-05-2016 17:45  ...    4.7          Meeting
4    01-06-2016 14:42  01-06-2016 15:49  ...   63.7   Customer Visit
..                ...               ...  ...    ...              ...
995  11-23-2016 16:49  11-23-2016 17:00  ...    3.3    Not Mentioned
996  11-23-2016 18:37  11-23-2016 18:47  ...    1.3    Not Mentioned
997  11-25-2016 11:47  11-25-2016 12:04  ...   10.3          Meeting
998  11-25-2016 13:13  11-25-2016 13:31  ...   11.1          Meeting
999  11-26-2016 15:54  11-26-2016 15:59  ...    1.4    Not Mentioned

[1000 rows x 7 columns]

In [ ]:
df["PURPOSE*"].value_counts()

Meeting            690
Meal-Entertain     160
Errand-Supplies    128
Customer Visit     101
Temporary Site      50
Between Offices     18
Moving               4
Airport-Travel       3
Commute              1
Charity ($)          1
Name: PURPOSE*, dtype: int64

### Matrix operations use case

> Numpy section

### Example 1 - compute month on month growth in sales

In [ ]:
store_sales.head()

In [ ]:
sales_mat = np.array(store_sales.iloc[:,2:])

In [ ]:
sales_mat

In [ ]:
sales_mat_lag = sales_mat[:,1:]
sales_mat_lag

In [ ]:
sales_mat_lag = sales_mat[:,1:]
sales_mat_lag = np.c_[sales_mat_lag,np.zeros(100)]

In [ ]:
sales_diff = sales_mat_lag - sales_mat

In [ ]:
perct_change = pd.DataFrame(sales_diff/sales_mat)

In [ ]:
perct_change.head()

### Example 1 - compute net revenue

In [ ]:
profit_mat = np.random.uniform(low=0.05, high=0.25, size=(100,12))

In [ ]:
## Find total annual profit for each store
profit_mat = profit_mat.transpose()

In [ ]:
profit_mat.shape

In [ ]:
prof_matrix = np.dot(sales_mat,profit_mat)

In [ ]:
prof_matrix.shape

In [ ]:
n=eval(input("Enter a number: "))
res = lambda n : 1 if n==1 or n==0 else n*res(n-1)
print(n,"! =",res(n))